MicrochipTech/mla_usb/inc/usb_hal_pic32mm.h
#define USBDisableInterrupts()      {IEC0CLR = _IEC0_USBIE_MASK;}

#if defined(USB_INTERRUPT)
    #define USBMaskInterrupts()     {IEC0CLR = _IEC0_USBIE_MASK;}
    #define USBUnmaskInterrupts()   {IEC0SET = _IEC0_USBIE_MASK;}
#else
    #define USBMaskInterrupts()
    #define USBUnmaskInterrupts()
#endif



//----- BDnSTAT bit definitions -----------------------------------------------
#define _BSTALL                         0x04        //Buffer Stall enable
#define _DTSEN                          0x08        //Data Toggle Synch enable
#define _DAT0                           0x00        //DATA0 packet expected next
#define _DAT1                           0x40        //DATA1 packet expected next
#define _DTSMASK                        0x40        //DTS Mask
#define _USIE                           0x80        //SIE owns buffer
#define _UCPU                           0x00        //CPU owns buffer
#define _STAT_MASK                      0xFC

//----- USTAT bit definitions -------------------------------------------------
#define USTAT_EP0_PP_MASK               ~0x04
#define USTAT_EP_MASK                   0xFC
#define USTAT_EP0_OUT                   0x00
#define USTAT_EP0_OUT_EVEN              0x00
#define USTAT_EP0_OUT_ODD               0x04
#define USTAT_EP0_IN                    0x08
#define USTAT_EP0_IN_EVEN               0x08
#define USTAT_EP0_IN_ODD                0x0C
#define ENDPOINT_MASK                   0xF0

//----- U1EP bit definitions --------------------------------------------------
#define UEP_STALL                       0x0002
// Cfg Control pipe for this ep
#define EP_CTRL                         0x0C
#define EP_OUT                          0x18            // Cfg OUT only pipe for this ep
#define EP_IN                           0x14            // Cfg IN only pipe for this ep
#define EP_OUT_IN                       0x1C            // Cfg both OUT & IN pipes for this ep
#define HSHK_EN                         0x01            // Enable handshake packet
                                                        // Handshake should be disable for isoch


#define BDT_BASE_ADDR_TAG   __attribute__ ((aligned (512)))
#define CTRL_TRF_SETUP_ADDR_TAG
#define CTRL_TRF_DATA_ADDR_TAG

//----- Depricated defintions - will be removed at some point of time----------
//--------- Depricated in v2.2
#define _LS                             0x00        // Use Low-Speed USB Mode
#define _FS                             0x00        // Use Full-Speed USB Mode
#define _TRINT                          0x00        // Use internal transceiver
#define _TREXT                          0x00        // Use external transceiver
#define _PUEN                           0x00        // Use internal pull-up resistor
#define _OEMON                          0x00        // Use SIE output indicator

/*****************************************************************************/
/****** Type definitions *****************************************************/
/*****************************************************************************/

// Buffer Descriptor Status Register layout.
typedef union __attribute__ ((packed)) _BD_STAT
{
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    BSTALL  :1;     //Buffer Stall Enable
        unsigned    DTSEN   :1;     //Data Toggle Synch Enable
        unsigned            :2;     //Reserved - write as 00
        unsigned    DTS     :1;     //Data Toggle Synch Value
        unsigned    UOWN    :1;     //USB Ownership
    };
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    PID0    :1;
        unsigned    PID1    :1;
        unsigned    PID2    :1;
        unsigned    PID3    :1;

    };
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    PID     :4;         //Packet Identifier
    };
    uint16_t           Val;
} BD_STAT;

// BDT Entry Layout
typedef union __attribute__ ((packed))__BDT
{
    struct __attribute__ ((packed))
    {
        BD_STAT     STAT;
        uint16_t        CNT:10;
        uint32_t       ADR;                      //Buffer Address
    };
    struct __attribute__ ((packed))
    {
        uint32_t       res  :16;
        uint32_t       count:10;
    };
    uint32_t           w[2];
    uint16_t            v[4];
    uint64_t           Val;
} BDT_ENTRY;

// USTAT Register Layout
typedef union __USTAT
{
    struct
    {
        unsigned char filler1           :2;
        unsigned char ping_pong         :1;
        unsigned char direction         :1;
        unsigned char endpoint_number   :4;
    };
    uint8_t Val;
} USTAT_FIELDS;

//Macros for fetching parameters from USTAT_FIELDS variable.
#define USBHALGetLastEndpoint(stat)     stat.endpoint_number
#define USBHALGetLastDirection(stat)    stat.direction
#define USBHALGetLastPingPong(stat)     stat.ping_pong


typedef union _POINTER
{
    struct
    {
        uint8_t bLow;
        uint8_t bHigh;
        //uint8_t bUpper;
    };
    uint16_t _uint16_t;                         // bLow & bHigh

    //pFunc _pFunc;                       // Usage: ptr.pFunc(); Init: ptr.pFunc = &<Function>;

    uint8_t* bRam;                         // Ram byte pointer: 2 bytes pointer pointing
                                        // to 1 byte of data
    uint16_t* wRam;                         // Ram word pointer: 2 bytes pointer pointing
                                        // to 2 bytes of data

    const uint8_t* bRom;                     // Size depends on compiler setting
    const uint16_t* wRom;
    //const near uint8_t* nbRom;               // Near = 2 bytes pointer
    //const near uint16_t* nwRom;
    //const far uint8_t* fbRom;                // Far = 3 bytes pointer
    //const far uint16_t* fwRom;
} POINTER;

/*****************************************************************************/
/****** Function prototypes and macro functions ******************************/
/*****************************************************************************/


#define ConvertToPhysicalAddress(a)   ((uint32_t)KVA_TO_PA(a))
#define ConvertToVirtualAddress(a)    PA_TO_KVA1(a)

#if defined(__PIC32__)
    #if defined(_IFS1_USBIF_MASK)
        #define _ClearUSBIF()   {IFS1CLR = _ISF1_USBIF_MASK;}
        #define _SetUSBIF()     {IEC1SET = _IEC1_USBIE_MASK;}
		#define USBClearUSBInterrupt()        {IFS1CLR = _IFS1_USBIF_MASK;}
    #elif defined(_IFS0_USBIF_MASK)
        #define _ClearUSBIF()   {IFS0CLR = _IFS0_USBIF_MASK;}
        #define _SetUSBIE()     {IEC0SET = _IEC0_USBIE_MASK;}
		#define USBClearUSBInterrupt()        {IFS0CLR = _IFS0_USBIF_MASK;}
    #else
        #error Cannot clear USB interrupt.
    #endif
#endif


#ifndef KVA_TO_PA
    #define KVA_TO_PA(kva) ((uint32_t)(kva) & 0x1fffffff)
#endif

