MicrochipTech/mla_usb/inc/usb_hal_pic32mm.h
#ifndef PA_TO_KVA1
    #define PA_TO_KVA1(pa)    ((uint32_t)(pa) | 0xA0000000)
#endif

#define USBInterruptFlag        IFS0bits.USBIF
#define USBInterruptEnableBit   IEC0bits.USBIE
#define USBIPLBits              IPC7bits.USBIP


/********************************************************************
 * Function (macro): void USBClearInterruptFlag(register, uint8_t if_flag_offset)
 *
 * PreCondition:    None
 *
 * Input:
 *   register - the register mnemonic for the register holding the interrupt
 *				flag to be "kleared"
 *   uint8_t if_flag_offset - the bit position offset (for the interrupt flag to
 *							"klear") fconst the "right of the register"
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Klears the specified USB interrupt flag.
 *
 * Note:    		Individual USB interrupt flag bits are "Kleared" by writing
 *					'1' to the bit
 *******************************************************************/
#define USBClearInterruptFlag(reg_name, if_flag_offset)	(reg_name = (1 << if_flag_offset))




#if !defined(Sleep)
    #define REGISTER_UNLOCK_SEQUENCE()  {SYSKEY = 0; SYSKEY = 0xAA996655; SYSKEY = 0x556699AA;}
    #define REGISTER_LOCK_SEQUENCE()    {SYSKEY = 0;}
    #define WRITE_OSCCON(newVal)        {REGISTER_UNLOCK_SEQUENCE(); OSCCON = newVal; REGISTER_LOCK_SEQUENCE();}
    #define Sleep()                     {WRITE_OSCCON(OSCCON | 0x00000010); _wait();}       //Set OSCCON<SLPEN> = 1 (to sleep instead of idle), then execute wait instruction)
#endif


#define SetConfigurationOptions()       {U1CNFG1 = USB_SPEED_OPTION; U1EIE = 0x9F; U1IE = 0x99 | USB_SOF_INTERRUPT | USB_ERROR_INTERRUPT; U1OTGCON &= 0x000F;  U1OTGCON |= USB_PULLUP_OPTION;}


/********************************************************************
Function:
    bool USBSleepOnSuspend(void)

Summary:
    Places the core into sleep and sets up the USB module
    to wake up the device on USB activity (either USB host resume or
    USB VBUS going away, such as due to USB cable detach).

PreCondition:
    The USBDeviceInit() function should have been called at least once and the
    USB host should have suspended the USB device.

Parameters:
    None

Return Values:
    true  - if entered sleep successfully
    false - if there was an error entering sleep

Remarks:
    Please note that before calling this function that it is the
    responsibility of the application to place all of the other
    peripherals or board features into a lower power state if
    required.

    Based on the USB specifications, upon detection of the suspend condition, a
    USB device should promptly put itself into a low power mode (such that it consumes
    no more than 2.5mA from the USB host (unless the host is a USB type-C host and
    is actively advertising higher than standard USB spec current capability).

*******************************************************************/
bool USBSleepOnSuspend(void);

/****************************************************************
    Function:
        void USBPowerModule(void)

    Description:
        This macro is used to power up the USB module if required:
        PIC16: defines as nothing
        PIC18: defines as nothing
        PIC24: defines as U1PWRCbits.USBPWR = 1;
        PIC32: defines as U1PWRCbits.USBPWR = 1;

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBPowerModule() U1PWRCbits.USBPWR = 1;

/****************************************************************
    Function:
        void USBModuleDisable(void)

    Description:
        This macro is used to disable the USB module.  This will perform a
        USB soft detach operation from the host, if the device was already plugged
        into the host at the time of calling this function.  All USB module
        features including the internal USB 1ms timer and the USB VBUS
        monitoring comparators will be disabled.

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBModuleDisable() {\
    U1CON = 0;\
    U1IE = 0;\
    U1OTGIE = 0;\
    U1PWRCbits.USUSPND = 0;\
    U1PWRCbits.USBPWR = 0;\
    USBDeviceState = DETACHED_STATE;\
}

/****************************************************************
    Function:
        USBSetBDTAddress(addr)

    Description:
        This macro is used to power up the USB module if required

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBSetBDTAddress(addr)         {U1BDTP3 = (((uint32_t)KVA_TO_PA(addr)) >> 24); U1BDTP2 = (((uint32_t)KVA_TO_PA(addr)) >> 16); U1BDTP1 = (((uint32_t)KVA_TO_PA(addr)) >> 8);}

/****************************************************************
    Function:
        void USBClearInterruptRegister(int register)

    Description:
        Clears all of the interrupts in the requested register

    Parameters:
        register - the register that needs to be cleared.

    Return Values:
        None

    Remarks:
        Note that on these devices to clear an interrupt you must
        write a '1' to the interrupt location.

  ****************************************************************/
#define USBClearInterruptRegister(reg)  {reg = 0xFFFFFFFF;}

/********************************************************************
    Function:
        void USBClearInterruptFlag(register, uint8_t if_flag_offset)

    Summary:
        Clears the specified USB interrupt flag.

    PreCondition:
        None

    Parameters:
        register - the register mnemonic for the register holding the interrupt
                   flag to be cleared
        uint8_t if_flag_offset - the bit position offset (for the interrupt flag to
                   clear) from the "right of the register"

    Return Values:
        None

